armade/contiki_sam4s/platform/pd956/net/rf233.c
	trx_reg_write(0x22, d[0]);
	trx_reg_write(0x23, d[1]);
}
void SetShortAddr(uint16_t addr)
{
	uint8_t *d = (uint8_t *)&addr;

	trx_reg_write(0x20, d[0]);
	trx_reg_write(0x21, d[1]);
	trx_reg_write(0x2d, d[0] + d[1]);
}

/*---------------------------------------------------------------------------*/
/* switch the radio on */
int
on(void)
{
  /* Check whether radio is in sleep */
  if(sleep_on)
  {
     /* Wake the radio. It'll move to TRX_OFF state */
	
  	 wake_from_sleep();
  	BUSYWAIT_UNTIL(0, (1 * RTIMER_SECOND / 1000)+1);
	 //delay_ms(1);
	 //printf("\r\nWake from sleep %d",rf233_get_channel());
	 sleep_on = 0;
  }
  uint8_t state_now = rf233_status();
  if(state_now != STATE_PLL_ON && state_now != STATE_TRX_OFF 
#if NULLRDC_CONF_802154_AUTOACK_HW
  && state_now != STATE_TX_ARET_ON
#endif
  ) {
    /* fail, we need the radio transceiver to be in either of those states */
    return -1;
  }

  /* go to RX_ON state */
  ENERGEST_ON(ENERGEST_TYPE_LISTEN);
  #if NULLRDC_CONF_802154_AUTOACK_HW
  RF233_COMMAND(TRXCMD_RX_AACK_ON);
  #else
  RF233_COMMAND(TRXCMD_RX_ON); 
  #endif
  radio_is_on = 1;
  return 0;
}
/*---------------------------------------------------------------------------*/
/* switch the radio off */
int
off(void)
{ 
	volatile int status = rf233_status();

	if(status == STATE_TRX_OFF)
		return 0;

	/* turn off the radio transceiver */
	ENERGEST_OFF(ENERGEST_TYPE_LISTEN);
	RF233_COMMAND(TRXCMD_FORCE_TRX_OFF);
	do
	{
		status = rf233_status();
	} while (status == STATE_TRANSITION);
	if(status == STATE_TRX_OFF){
		radio_is_on = 0;
		return 0;
	}
	else
		return -1;
}
/*---------------------------------------------------------------------------*/
/* Put the Radio in sleep mode */

int 
rf233_sleep(void)
{
	int status = -1;
	/* Check whether we're already sleeping */
	if (!sleep_on) {
		/* Turn off the Radio */
		status = rf233_off();
		/* Set the SLP_PIN to high */
		if(status == 0) {
			sleep_on = 1;
			goto_sleep();
		}
	}
	
	return status;
}
/*---------------------------------------------------------------------------*/
/* used for indicating that the interrupt wasn't able to read SPI and must be serviced */
static volatile int interrupt_callback_wants_poll = 0;
/* used as a blocking semaphore to indicate that we are currently servicing an interrupt */
static volatile int interrupt_callback_in_progress = 0;

/**
 * \brief      Radio RF233 process, infinitely awaits a poll, then checks radio
 *             state and handles received data.
 */
PROCESS_THREAD(rf233_radio_process, ev, data)
{
  int len;
  PROCESS_BEGIN();
  PRINTF("RF233: started.\n");

  while(1) {
    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);
    PRINTF("RF233: polled.\n");

    if(interrupt_callback_wants_poll) {
      rf233_interrupt_poll();
    }

    packetbuf_clear();
    // packetbuf_set_attr(PACKETBUF_ATTR_TIMESTAMP, last_packet_timestamp);
    len = rf233_read(packetbuf_dataptr(), PACKETBUF_SIZE);
    if(len > 0) {
      packetbuf_set_datalen(len);
      NETSTACK_RDC.input();
    } else {
      PRINTF("RF233: error while reading: %d\n", len);
    }
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
/**
 * \brief      RF233 radio process poll function, to be called from the
 *             interrupt handler to poll the radio process
 * \retval 0   success
 */
int
rf233_interrupt_poll(void)
{  
	volatile uint8_t irq_source;
	 /* handle IRQ source (for what IRQs are enabled, see rf233-config.h) */
	 irq_source = trx_reg_read(RF233_REG_IRQ_STATUS);
	 if(irq_source & IRQ_TRX_DONE) {
		 
		 if(flag_transmit==1)
		 {
			 flag_transmit=0;
			 interrupt_callback_in_progress = 0;
			 #if NULLRDC_CONF_802154_AUTOACK_HW
			//printf("Status %x",trx_reg_read(RF233_REG_TRX_STATE) & TRX_STATE_TRAC_STATUS);
			if(!(trx_reg_read(RF233_REG_TRX_STATE) & TRX_STATE_TRAC_STATUS))
			ack_status = 1;
			 RF233_COMMAND(TRXCMD_RX_AACK_ON);
			 #endif
			 return 0;
		 }
  
  if( interrupt_callback_in_progress) {
    /* we cannot read out info from radio now, return here later (through a poll) */
    interrupt_callback_wants_poll = 1;
    process_poll(&rf233_radio_process);
    PRINTF("RF233: irq but busy, returns later.\n");
    return 0;
  }

  interrupt_callback_wants_poll = 0;
  interrupt_callback_in_progress = 1;

 
    /* we have started receiving a frame, len can be read */
    pending_frame = 1;
	//delay_cycles_ms(1);
    process_poll(&rf233_radio_process);
  }

#if 0
  /* Note, these are not currently in use but here for completeness. */
  if(irq_source & IRQ_TRX_DONE) {
    /* End of transmitted or received frame.  */
  }
  if(irq_source & IRQ_TRXBUF_ACCESS_VIOLATION) {
    /* 
     * Access violation on the shared TX/RX FIFO. Possible causes:
     *  - buffer underrun while transmitting, ie not enough data in FIFO to tx
     *  - reading too fast from FIFO during rx, ie not enough data received yet
     *  - haven't read last rxed frame when next rx starts, but first is possible
     *    to read out, with possible corruption - check FCS
     *  - writing frames larger than 127 B to FIFO (len byte)
     */
    PRINTF("RF233-arch: access violation.\n");
  }
  if(irq_source & IRQ_BAT_LOW) {
    /* Battery low */
  }
  if(irq_source & IRQ_RX_ADDRESS_MATCH) {
    /* receiving frame address match */
  }
  if(irq_source & IRQ_CCA_ED_DONE) {
    /* CCA/ED done */
  }
  if(irq_source & IRQ_PLL_UNLOCK) {
    /* PLL unlock */
  }
  if(irq_source & IRQ_PLL_LOCK) {
    /* PLL lock */
  }
#endif

  interrupt_callback_in_progress = 0;
  return 0;
}

#if !NULLRDC_CONF_802154_AUTOACK_HW
/*---------------------------------------------------------------------------*/
/* 
 * Hard, brute reset of radio core and re-init due to it being in unknown,
 * unexpected, or locked state from which we cannot recover in the usual places.
 * Does a full reset and re-init.
 */
static void
radiocore_hard_recovery(void)
{
  rf233_init();
}
#endif


/*---------------------------------------------------------------------------*/
/* 
 * Crude way of flushing the Tx/Rx FIFO: write the first byte as 0, indicating
 * a zero-length frame in the buffer. This is interpreted by the driver as an
 * empty buffer.
 */
/*static void
flush_buffer(void)
{
  // NB: tentative untested implementation
  uint8_t temp = 0;
  trx_frame_write(&temp, 1);
}*/
void
goto_sleep(void)
{
	TRX_SLP_TR_HIGH();//port_pin_set_output_level(AT86RFX_SLP_PIN, true);
}
void
wake_from_sleep(void)
{
  /* 
   * Triggers a radio state transition - assumes that the radio already is in
   * state SLEEP or DEEP_SLEEP and SLP_TR pin is low. Refer to datasheet 6.6.
   * 
   * Note: this is the only thing that can get the radio from state SLEEP or 
   * state DEEP_SLEEP!
   */
	TRX_SLP_TR_LOW();// port_pin_set_output_level(AT86RFX_SLP_PIN, false);
}

uint8_t rf233_status()
{
	return (trx_reg_read(RF233_REG_TRX_STATUS) & TRX_STATUS);
}
/*---------------------------------------------------------------------------*/
